In [1]:
import pandas as pd

In [7]:
df=pd.read_csv("D:/studymaterial/DATA SCIENCE/drinks.csv")
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [11]:
x=df.groupby("continent")
x.first()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
AF,Algeria,25,0,14,0.7
AS,Afghanistan,0,0,0,0.0
EU,Albania,89,132,54,4.9
OC,Australia,261,72,212,10.4
SA,Argentina,193,25,221,8.3

In [13]:
x.get_group("AF")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
2,Algeria,25,0,14,0.7,AF
4,Angola,217,57,45,5.9,AF
18,Benin,34,4,13,1.1,AF
22,Botswana,173,35,35,5.4,AF
26,Burkina Faso,25,7,7,4.3,AF
27,Burundi,88,0,0,6.3,AF
28,Cote d'Ivoire,37,1,7,4.0,AF
29,Cabo Verde,144,56,16,4.0,AF
31,Cameroon,147,1,4,5.8,AF
33,Central African Republic,17,2,1,1.8,AF
34,Chad,15,1,1,0.4,AF
38,Comoros,1,3,1,0.1,AF
39,Congo,76,1,9,1.7,AF
47,DR Congo,32,3,1,2.3,AF
49,Djibouti,15,44,3,1.1,AF
53,Egypt,6,4,1,0.2,AF
55,Equatorial Guinea,92,0,233,5.8,AF
56,Eritrea,18,0,0,0.5,AF
58,Ethiopia,20,3,0,0.7,AF
62,Gabon,347,98,59,8.9,AF
63,Gambia,8,0,1,2.4,AF
66,Ghana,31,3,10,1.8,AF
70,Guinea,9,0,2,0.2,AF
71,Guinea-Bissau,28,31,21,2.5,AF
88,Kenya,58,22,2,1.8,AF
95,Lesotho,82,29,0,2.8,AF
96,Liberia,19,152,2,3.1,AF
97,Libya,0,0,0,0.0,AF
100,Madagascar,26,15,4,0.8,AF
101,Malawi,8,11,1,1.5,AF
104,Mali,5,1,1,0.6,AF
107,Mauritania,0,0,0,0.0,AF
108,Mauritius,98,31,18,2.6,AF
114,Morocco,12,6,10,0.5,AF
115,Mozambique,47,18,5,1.3,AF
117,Namibia,376,3,1,6.8,AF
123,Niger,3,2,1,0.1,AF
124,Nigeria,42,5,2,9.1,AF
142,Rwanda,43,2,0,6.8,AF
148,Sao Tome & Principe,56,38,140,4.2,AF
150,Senegal,9,1,7,0.3,AF
152,Seychelles,157,25,51,4.1,AF
153,Sierra Leone,25,3,2,6.7,AF
158,Somalia,0,0,0,0.0,AF
159,South Africa,225,76,81,8.2,AF
162,Sudan,8,13,0,1.7,AF
164,Swaziland,90,2,2,4.7,AF
172,Togo,36,2,19,1.3,AF
175,Tunisia,51,3,20,1.3,AF
179,Uganda,45,9,0,8.3,AF
183,Tanzania,36,6,1,5.7,AF
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [17]:
#group by is applied on the discrete values
var=df.groupby(["continent","country"])
var.first()

                        beer_servings  spirit_servings  wine_servings  \
continent country
AF        Algeria                  25                0             14
          Angola                  217               57             45
          Benin                    34                4             13
          Botswana                173               35             35
          Burkina Faso             25                7              7
...                               ...              ...            ...
SA        Paraguay                213              117             74
          Peru                    163              160             21
          Suriname                128              178              7
          Uruguay                 115               35            220
          Venezuela               333              100              3

                        total_litres_of_pure_alcohol
continent country
AF        Algeria                                0.7
          Angola                                 5.9
          Benin                                  1.1
          Botswana                               5.4
          Burkina Faso                           4.3
...                                              ...
SA        Paraguay                               7.3
          Peru                                   6.1
          Suriname                               5.6
          Uruguay                                6.6
          Venezuela                              7.7

[170 rows x 4 columns]

In [19]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [23]:
#what is the total wine serving for the asia continent
y=df.groupby("continent").agg({"wine_servings":"sum"})
y

           wine_servings
continent
AF                   862
AS                   399
EU                  6400
OC                   570
SA                   749

In [27]:
#to add the all column's values--->use sum
df.groupby("continent").agg({"spirit_servings":"max"})

           spirit_servings
continent
AF                     152
AS                     326
EU                     373
OC                     254
SA                     302

In [33]:
#sum and average of wine serving for "AS"
df.groupby("continent").agg({"wine_servings":["sum","mean"],"spirit_servings":"min"})

          wine_servings             spirit_servings
                    sum        mean             min
continent
AF                  862   16.264151               0
AS                  399    9.068182               0
EU                 6400  142.222222               0
OC                  570   35.625000               0
SA                  749   62.416667              25

In [37]:
dt=pd.read_csv("D:/studymaterial/DATA SCIENCE/air_quality_no2_long_lyst1726832896789.csv")
dt

,city,country,date.utc,location,parameter,value,unit
0,Paris,FR,2019-06-21 00:00:00+00:00,FR04014,no2,20.0,µg/m³
1,Paris,FR,2019-06-20 23:00:00+00:00,FR04014,no2,21.8,µg/m³
2,Paris,FR,2019-06-20 22:00:00+00:00,FR04014,no2,26.5,µg/m³
3,Paris,FR,2019-06-20 21:00:00+00:00,FR04014,no2,24.9,µg/m³
4,Paris,FR,2019-06-20 20:00:00+00:00,FR04014,no2,21.4,µg/m³
...,...,...,...,...,...,...,...
2063,London,GB,2019-05-07 06:00:00+00:00,London Westminster,no2,26.0,µg/m³
2064,London,GB,2019-05-07 04:00:00+00:00,London Westminster,no2,16.0,µg/m³
2065,London,GB,2019-05-07 03:00:00+00:00,London Westminster,no2,19.0,µg/m³
2066,London,GB,2019-05-07 02:00:00+00:00,London Westminster,no2,19.0,µg/m³
2067,London,GB,2019-05-07 01:00:00+00:00,London Westminster,no2,23.0,µg/m³

In [43]:
dt.dtypes

city          object
country       object
date_time     object
location      object
parameter     object
value        float64
unit          object
dtype: object

In [41]:
#not do as dt.date.utc but as dt[date.utc]
dt=dt.rename(columns={"date.utc":"date_time"})

In [45]:
#change from object type to date time type--->4 bit nenosecond, UTC is encoding formate=time zone
dt["date_time"]=pd.to_datetime(dt["date_time"])

In [63]:
dt.dtypes

city                      object
country                   object
date_time    datetime64[ns, UTC]
location                  object
parameter                 object
value                    float64
unit                      object
dtype: object

In [49]:
dt["date_time"].min()

Timestamp('2019-05-07 01:00:00+0000', tz='UTC')

In [51]:
dt["date_time"].max()

Timestamp('2019-06-21 00:00:00+0000', tz='UTC')

In [53]:
#dt.month is method for date and time, how many entries do we have for may?
dt["date_time"].dt.month

0       6
1       6
2       6
3       6
4       6
       ..
2063    5
2064    5
2065    5
2066    5
2067    5
Name: date_time, Length: 2068, dtype: int32

In [55]:
dt["date_time"].dt.month.value_counts()

date_time
5    1256
6     812
Name: count, dtype: int64

In [61]:
#dt.minutes , dt.weekday etc.
dt["date_time"].dt.hour

0        0
1       23
2       22
3       21
4       20
        ..
2063     6
2064     4
2065     3
2066     2
2067     1
Name: date_time, Length: 2068, dtype: int32

In [65]:
#concatenation=ilogical add of entres
"a"+"a"

'aa'

## concatenation

In [74]:
div_1=pd.DataFrame({"roll_no":[1,2,3],"first_name":["riya","siya","keshav"],"last_name":["x","y","z"],"English":[10,49,50]})
div_2=pd.DataFrame({"roll_no":[1,2,3],"first_name":["kanha","hemant","leela"],"last_name":["b","c","d"],"English":[20,30,40]})
div_1

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50

In [76]:
div_2

   roll_no first_name last_name  English
0        1      kanha         b       20
1        2     hemant         c       30
2        3      leela         d       40

In [78]:
final=pd.concat([div_1,div_2],axis=0)
final

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50
0        1      kanha         b       20
1        2     hemant         c       30
2        3      leela         d       40

In [80]:
x_1=final.copy()
x_1

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50
0        1      kanha         b       20
1        2     hemant         c       30
2        3      leela         d       40

In [84]:
final=final.reset_index()
final

   index  roll_no first_name last_name  English
0      0        1       riya         x       10
1      1        2       siya         y       49
2      2        3     keshav         z       50
3      0        1      kanha         b       20
4      1        2     hemant         c       30
5      2        3      leela         d       40

In [86]:
#final.drop(["index","roll_no"],axis=1)-->to delete two columns
del final["index"]

In [90]:
final

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50
3        1      kanha         b       20
4        2     hemant         c       30
5        3      leela         d       40

In [92]:
x_1

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50
0        1      kanha         b       20
1        2     hemant         c       30
2        3      leela         d       40

In [94]:
x_1=x_1.set_index("roll_no")

In [96]:
x_1

        first_name last_name  English
roll_no
1             riya         x       10
2             siya         y       49
3           keshav         z       50
1            kanha         b       20
2           hemant         c       30
3            leela         d       40

# Merging and Joining:

## 4types of joining-left ,right,inner and outer

In [133]:
div_3=pd.DataFrame({"roll_no":[1,2,3,4],"first_name":["riya","siya","keshav","sangeeta"],"last_name":["x","y","z","alpha"],"English":[10,49,50,38]})
div_4=pd.DataFrame({"roll_no":[4,5,6,7],"first_name":["sangeeta","kiran","saumya","KRISHNA"],"last_name":["alpha","AY","AZ","AA"],"Hindi":[14,39,27,40]})

In [135]:
div_3

   roll_no first_name last_name  English
0        1       riya         x       10
1        2       siya         y       49
2        3     keshav         z       50
3        4   sangeeta     alpha       38

In [137]:
div_4

   roll_no first_name last_name  Hindi
0        4   sangeeta     alpha     14
1        5      kiran        AY     39
2        6     saumya        AZ     27
3        7    KRISHNA        AA     40

In [139]:
pd.merge(div_3,div_4,on=["roll_no","first_name","last_name"],how="outer")

   roll_no first_name last_name  English  Hindi
0        1       riya         x     10.0    NaN
1        2       siya         y     49.0    NaN
2        3     keshav         z     50.0    NaN
3        4   sangeeta     alpha     38.0   14.0
4        5      kiran        AY      NaN   39.0
5        6     saumya        AZ      NaN   27.0
6        7    KRISHNA        AA      NaN   40.0

In [131]:
pd.merge(div_3,div_4,on=["roll_no","first_name","last_name"],how="outer")

   roll_no first_name last_name  English  Hindi
0        1       riya         x     10.0    NaN
1        2       siya         y     49.0    NaN
2        3     keshav         z     50.0    NaN
3        4   sangeeta        AX      NaN   14.0
4        4   sangeeta     alpha     38.0    NaN
5        5      kiran        AY      NaN   39.0
6        6     saumya        AZ      NaN   27.0
7        7    KRISHNA        AA      NaN   40.0

# 6Libraries

# matplotlib,seaborn,pygal,plotly,geoplotlib

In [ ]:
#seaborn=complex graph, linear graph, machine learning graphs etc
#matplotlib= normal graph: bar ,pie graph, and beautification of graph=legend, color size shape
#Pygal=help to download graph to use in ppt and convert html : link and png formate
#plotly= to zoom in and out, change the access grid, take particular part of graph and picture
#geoplotlib= distance of longitude and latitude creating in it- world level plotting

# Seaborn Library

# plotting:

In [145]:
import seaborn as sns